# Pandas accessing data in dataframe

In [2]:
import pandas as pd
df = pd.read_csv('../NUS/ChallengerSales.csv')
df.head(5)

,Date,Day,Time,Gender,BuyCategory,ItemsOrdered,TotalCost,HighItem,Member,Region
0,6-Mar,Mon,Morning,Female,High,4,136.97,79.97,Yes,West
1,6-Mar,Mon,Morning,Female,Medium,1,25.55,25.55,No,West
2,6-Mar,Mon,Afternoon,Female,Medium,5,113.95,90.47,Yes,West
3,6-Mar,Mon,Afternoon,Female,Low,1,6.82,6.82,No,East
4,6-Mar,Mon,Afternoon,Male,Medium,4,147.32,83.21,Yes,West

In [5]:
region = df["Region"]
region

0      West
1      West
2      West
3      East
4      West
       ...
395    East
396    East
397    West
398    East
399    East
Name: Region, Length: 400, dtype: object

In [6]:
type(region)

pandas.core.series.Series

In [7]:
df[["Region","Day"]]

    Region  Day
0     West  Mon
1     West  Mon
2     West  Mon
3     East  Mon
4     West  Mon
..     ...  ...
395   East  Sat
396   East  Sat
397   West  Sat
398   East  Sat
399   East  Sat

[400 rows x 2 columns]

In [11]:
type(df[["Region","Day"]])

pandas.core.frame.DataFrame

In [12]:
df['Region'][5]

'East'

In [13]:
df.columns

Index(['Date', 'Day', 'Time', 'Gender', 'BuyCategory', 'ItemsOrdered',
       'TotalCost', 'HighItem', 'Member', 'Region'],
      dtype='object')

In [15]:
cols_needed = ['Gender','Member','Region','TotalCost']
df_short = df[cols_needed]
print(df_short)

     Gender Member Region  TotalCost
0    Female    Yes   West     136.97
1    Female     No   West      25.55
2    Female    Yes   West     113.95
3    Female     No   East       6.82
4      Male    Yes   West     147.32
..      ...    ...    ...        ...
395    Male     No   East     268.39
396  Female     No   East     169.11
397    Male     No   West     242.46
398    Male     No   East     168.64
399  Female     No   East     107.59

[400 rows x 4 columns]

In [16]:
df_short2 = df[cols_needed][::2] # start , end , step = 2 so odd rows ( because 0 based ? )
df_short2.head(5)

   Gender Member Region  TotalCost
0  Female    Yes   West     136.97
2  Female    Yes   West     113.95
4    Male    Yes   West     147.32
6    Male     No   West      18.65
8    Male     No   West      25.83

In [18]:
df.loc[5,'Region'] #row index followed by the column name

'East'

In [19]:
df.loc[5] # whole row

Date                6-Mar
Day                   Mon
Time            Afternoon
Gender             Female
BuyCategory        Medium
ItemsOrdered            5
TotalCost          142.15
HighItem             50.9
Member                 No
Region               East
Name: 5, dtype: object

In [21]:
df_demo1 = df.loc[:,'Region'] #all the rows in the region column
df_demo1

0      West
1      West
2      West
3      East
4      West
       ...
395    East
396    East
397    West
398    East
399    East
Name: Region, Length: 400, dtype: object

In [24]:
cols_needed = ['Gender','Member','Region','TotalCost']
df_demo2 = df.loc[::2, cols_needed] #odd rows from the original dataset then just look at the specific columns
df_demo2.shape

(200, 4)

In [27]:
cols_needed = ['Gender','Member','Region','TotalCost']
rows_needed = [0,5,8,100]
df_demo3 = df.loc[rows_needed , cols_needed]
df_demo3

     Gender Member Region  TotalCost
0    Female    Yes   West     136.97
5    Female     No   East     142.15
8      Male     No   West      25.83
100    Male     No   East     100.02

In [30]:
df.iloc[5,3]

'Female'

In [31]:
len(df.columns)

10

In [35]:
print(df.iloc[5,:])
print(df.iloc[:,5])

Date                6-Mar
Day                   Mon
Time            Afternoon
Gender             Female
BuyCategory        Medium
ItemsOrdered            5
TotalCost          142.15
HighItem             50.9
Member                 No
Region               East
Name: 5, dtype: object
0      4
1      1
2      5
3      1
4      4
      ..
395    6
396    3
397    6
398    4
399    1
Name: ItemsOrdered, Length: 400, dtype: int64

In [36]:
df.iloc[0:5,2:6]

        Time  Gender BuyCategory  ItemsOrdered
0    Morning  Female        High             4
1    Morning  Female      Medium             1
2  Afternoon  Female      Medium             5
3  Afternoon  Female         Low             1
4  Afternoon    Male      Medium             4